frontend/controllers/SiteController.php

// $records = $command->queryAll();
$query = new Query();
$query->select('*')->from('user')->leftJoin('userinfo','user.id=userinfo.id')->where(['user.status'=>'2'])->all();
$command = $query->createCommand();
---
INSERT INTO `userstatus` (`user_id`, `date`, `status`, `subject`) VALUES (20, '2019-11-28', 3, 'Blah')