frontend/controllers/SiteController.php

SELECT * FROM `userstatus` WHERE `user_id`=3
---
    public function actionStatus()
    {

        if (Yii::$app->user->isGuest) {
            return $this->goHome(); }
        else {


            $status = UserStatus::find()
            ->where(['user_id'=>Yii::$app->user->identity->id])
            ->all();

INSERT INTO `userleave` (`user_id`, `status`, `leave_id`, `sub`, `brief`) VALUES (3, 0, NULL, 'dsa', 'sad')
DELETE FROM `userleave` WHERE `leave_id`='10'
SELECT * FROM `userleave` WHERE `leave_id`='10'
---
    public function actionLeave()
    {

        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        else {
            $searchModel = new AdminSearch();
            $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
            $dataProvider->query->andWhere('user_id = :id' , array(':id'=>Yii::$app->user->identity->id));

            $model = new UserLeave();
            if(Yii::$app->request->post('leave-button')==1){

            $model->user_id = Yii::$app->user->identity->id;
            $model->status = 0;
            $model->leave_id='';

            if ($model->load(Yii::$app->request->post()) && $model->save()) {
                Yii::$app->session->setFlash('success', 'Leave received! We will respond to you for conformation.');
                return $this->redirect(['leave']);
            }}

            if (Yii::$app->request->post('delete')) {
                $delid=Yii::$app->request->post('delete');
                $deletemodel = UserLeave::find()
                 ->where(['leave_id'=>$delid])
                 ->one()
                 ->delete();

SELECT * FROM `userleave` WHERE `leave_id`='11'
---
            if(Yii::$app->request->post('leave-button')!=null && Yii::$app->request->post('leave-button')!=1){


                $model1 = UserLeave::findOne(Yii::$app->request->post('leave-button'));

SELECT * FROM `userleave` WHERE `leave_id`='12'
---
            if (Yii::$app->request->post('edit')) {
                $editid=Yii::$app->request->post('edit');

                $editmodel = UserLeave::find()
                 ->where(['leave_id'=>$editid])
                 ->one();